{
  "title": "Best product design of 2025",
  "slug": "on-vision",
  "date": "2025-12-30",
  "content": "This year, I read of dozens of AI product launches, some of which failed spectacularly. Some of the most notable: the [Humane Pin](https://www.cnet.com/tech/mobile/humanes-ai-pin-failed-because-it-ignored-what-was-already-in-our-pockets/), a Star Trek-inspired wearable that didn't quite feel like a \"Next Generation\" wearable; the strangely [sycophantic ChatGPT update](https://www.bbc.com/news/articles/cn4jnwdvg9qo); and a Grok model that screamed of [white genocide](https://www.theguardian.com/technology/2025/may/14/elon-musk-grok-white-genocide).\n\nSo, as a reflex against the deluge of gimmicky AI tools, it is perhaps fitting my winner for best product design of 2025 is decidedly *low tech*.\n\nDon't, however, mistake me for an \"AI hater\"—in fact, several *great* AI tools made my \"best product\" shortlist for 2025. So, before revealing the winner, let's cover three honorable mentions:\n\n*Note: I only include products that I have personally used as part of my \"best of\" lists. For a more general review, I recommend [Wallpaper's 2025 list](https://www.wallpaper.com/tech/year-in-review-were-always-after-innovations-that-interest-us-here-are-ten-of-2025s-best).*\n\n![cursor-2.0.png](/images/cursor-2-0-1767485041720.png)\n## Honorable Mention #1: [Cursor 2.0](https://cursor.com/blog/2-0)\nCursor is a leading AI-powered code editor that stormed onto the scene a couple years back with a simple value prop: A Better AI-powered IDE than VS Code + Copilot.\n\nBut Cursor 2.0 took things to another level in 2025, refocusing the user interface on Agentic workflows and debuting Cursor's first in-house model, Composer. Cursor's Agent workflow, combined with the lightning-fast speed of Composer, allows for tight feedback loops between the user and the Agent. This tight process of prompting, evaluating, refining, and prompting again really clicked for me, opening up new avenues for rapid prototyping without losing design fidelity or creative control.\n\nHowever, Composer's use-cases are limited mainly to small tasks, while most users, including myself, swap to powerful third-party models like Opus 4.5 to handle greater complexity. Until this problem is solved, Cursor won't be able to fully distance itself from competitors like Claude Code and Google's Antigravity.\n\n![coros-pace-4.jpg](/images/coros-pace-4-1767484963036.jpg)\n## Honorable Mention #2: [COROS Pace 4](https://us.coros.com/pace4)\nCOROS is a smartwatch maker with a focus on performance sports. The COROS Pace specifically is an ultra lightweight watch packed with health sensors, training modes, and a monstrous battery life that often lasts me over 2 weeks.\n\nBut more than all those features, I appreciate the minimal nature of the watch — it does exactly what I want it to do—tell time, track workouts, and track sleep—and nothing more.\n\nI have never been able to stick with a smartwatch before, mostly because of the chore of charging *yet another* device every night, but also because I don't need my wrist screaming notifications 24/7. And yet, I've hardly walked outside without my COROS on for nearly all of 2025.\n\nThere is *one* significant drawback, though—especially if you value data privacy. COROS has core operations in China, and it's reasonable to think critically about its handling of user data. While this isn't a dealbreaker for me, it does preclude COROS from the top spot on this year's list.\n\n![call-screening.jpg](/images/call-screening-1767484655205.jpg)\n## Honorable Mention #3: [iOS 26 Call Screening](https://support.apple.com/guide/iphone/screen-and-block-calls-iphe4b3f7823/ios)\nSurprised to see a Siri feature on a best-of list? Me too. But, without a doubt, my favorite new feature of iOS 26 is the automatic Call Screening, which intercepts incoming calls from unknown numbers, and displays a chat-like interface on the lock screen. This interface shows the questions Siri is asking the caller, along with a transcription of their response.\n\nIf the caller seems legit, Siri lets them through. As a business owner that receives customer calls at odd hours, I was constantly having to answer \"unknown\" calls prior to this feature. Now, with a success rate well north of 90%, Siri silently handles spam callers, and correctly routes real callers straight to me.\n\nStill, I'm hoping for more customization opportunities, along with a (2026?) overhaul of Siri's AI capabilities to improve this feature more. Until then, Google [just simply does this better](https://www.tomsguide.com/phones/i-tested-call-screening-on-ios-26-vs-android-16-and-theres-a-clear-winner) with Android's similarly named \"Call Screen\".\n\n\n![remarkable.webp](https://raw.githubusercontent.com/bstanfield/new-benstanfieldio/main/images/remarkable-1767491811245.webp)\n## Best Product Design of 2025: [reMarkable Paper Pro Move](https://remarkable.com/products/remarkable-paper/pro-move)\nAnd finally, the winner: reMarkable Paper Pro Move. The \"Move\" is a compact, portable e-ink notebook, with a display so \"paper like\" it messes with your brain. The Move is simultaneously \"low-tech\", and also an impressive feat of engineering—deftly mimicking the feel of writing on real paper, while also designing a subtle operating system to store files, screenshare to a computer, and translate to plaintext, without losing the essence of a simple pen & paper.",
  "published": true
}