{
  "title": "Best product design of 2025",
  "slug": "on-vision",
  "date": "2025-12-30",
  "content": "2025 saw hundreds of AI product launches, some of which failed spectacularly, notably: the [Humane Pin](https://www.cnet.com/tech/mobile/humanes-ai-pin-failed-because-it-ignored-what-was-already-in-our-pockets/), a Star Trek-inspired wearable that didn't quite feel like a \"Next Generation\" wearable; the strangely [sycophantic ChatGPT update](https://www.bbc.com/news/articles/cn4jnwdvg9qo); and a Grok model that screamed of [white genocide](https://www.theguardian.com/technology/2025/may/14/elon-musk-grok-white-genocide).\n\nSo, as a reflex against the deluge of gimmicky AI tools, it is perhaps fitting my winner for best product design of 2025 is decidedly *low tech*.\n\nDon't, however, mistake me for an \"AI hater\"—in fact, several *great* AI tools made my \"best product\" shortlist for 2025. So, before revealing the winner, let's cover three honorable mentions:\n\n## Honorable Mention: [Cursor 2.0](https://cursor.com/blog/2-0)\nCursor is a leading AI-powered code editor that stormed onto the scene a couple years back with a simple value prop: A Better AI-powered IDE than VS Code + Copilot.\n\nBut Cursor 2.0 took things to another level in 2025, refocusing the user interface on Agentic workflows and debuting Cursor's first in-house model, Composer. Cursor's Agent workflow, combined with the lightning-fast speed of Composer, allows for tight feedback loops between the user and the Agent. This tight process of prompting, evaluating, refining, and prompting again really clicked for me, opening up new avenues for rapid prototyping without losing design fidelity or creative control.\n\nHowever, Composer's use-cases are limited mainly to small tasks, while most users, including myself, swap to powerful third-party models like Opus 4.5 to handle greater complexity. Until this problem is solved, Cursor won't be able to fully distance itself from competitors like Claude Code and Google's Antigravity.\n\n## Honorable Mention: [Coros Pace 4](https://us.coros.com/pace4)\n\n\n## Best Product Design of 2025: [reMarkable Paper Pro Move](https://remarkable.com/products/remarkable-paper/pro-move)",
  "published": false
}