{
  "title": "Reflections on 6 years as a founder at Wren",
  "slug": "reflections-on-6-years-as-a-founder-at-wren",
  "date": "2026-02-03",
  "content": "Friday marked my last day working on my first startup, Wren. I created the company in 2019 with my co-founders Mimi Tran Zambetti (now my fiancée), and Landon Brand. Over the years, we built a category-defining and category-leading marketplace, raised venture capital from prestigious investors like Y Combinator and Union Square Ventures, hired employees, let employees go, acquired competitors, got (partially) acquired ourselves, nearly ran out of money, eventually turned it around and reached profitability, and much more in-between. Landon and Mimi will continue running and growing Wren.\n\nI will do my best to chronicle my learnings, and perhaps more helpfully my failings and shortcomings, across six years building a startup straight out of college. Frankly, I am doing this more for myself than you (or anyone who happens to read this), so I apologize for anything lacking context. If you have questions, please find me online.\n\n### Early conviction, simple mission & product focus\n\n### Starting a startup straight out of college\nMajor pros and cons here—if you asked me, \"should I start a company out of college, or go work at big tech?\", I would wholeheartedly answer with yes, go start something yourself! But now, I am not sure I would give an answer one way or another.\n\n### Bridging trust gaps through design\n\n### Starting a startup with your *partner*\n\n### Picking aligned investors\n\n### Building in Climate Tech\n\n### Starting a company-within-a-company\n\n### Running a remote company for 7 years\n\n### Why I'm leaving and where I'm going next\n\n\n# Big topics\n- Starting a startup with your partner\n- Establishing values early (before third hire) ... reading V\n- Surviving (and thriving) as a climate startup, despite a global pandemic and two Trump administrations\n- Bridging trust gaps through design, education, and clever marketing\n- Finding aligned investors and scaling to profitability (but not hyper-scale)\n- Bootstrapping a second product (Topos) inside of Wren, and selling it\n- Wearing many hats (design, engineering, sales, fundraising, comms)\n- Leaving",
  "published": false,
  "coverImage": null
}